### Starter code for Project 3. 
#### Run these cells before starting the assignment.

#### 1. create BQ dataset:

In [1]:
%env dataset_id=school_enrollments

env: dataset_id=school_enrollments

In [2]:
!bq --location=US mk --dataset $dataset_id

BigQuery error in mk operation: Dataset 'river-runner-377401:school_enrollments'
already exists.

#### 2. create and populate BQ tables:

In [3]:
import os

In [4]:
gsutil_cmd = "gsutil ls gs://cs327e-open-access-2/school-enrollments/*"
file_listings = os.popen(gsutil_cmd)
dataset="school_enrollments"

for file in file_listings:

    start_index = file.rindex("_") + 1
    end_index = file.rindex(".")
    table = file[start_index:end_index]
    
    if table in ("co", "district", "fl", "ga", "id", "ma", "mo", "ne", "ny", "or", "school", "sd", "wi"):
        print("skipping " + table)
        continue

    bq_cmd = "bq --location=US load --autodetect --skip_leading_rows=1 "\
             "--source_format=CSV " + dataset + "." + table + ' ' + file
    print(bq_cmd)
    
    os.system(bq_cmd)

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ak gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ak.csv

Waiting on bqjob_r7350746d8d023a3c_00000186cd152d75_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ar gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ar.csv

Waiting on bqjob_r2eab364419f8657a_00000186cd154142_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ca gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ca.csv

Waiting on bqjob_r7ad15e01f9788af9_00000186cd155cea_1 ... (9s) Current status: DONE

skipping co
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ct gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ct.csv

Waiting on bqjob_r5d676433fba7c0e6_00000186cd158d9b_1 ... (2s) Current status: DONE

skipping district
skipping fl
skipping ga
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.hi gs://cs327e-open-access-2/school-enrollments/zf406jp4427_hi.csv

Waiting on bqjob_r1d3436eb1e321cd1_00000186cd15a11a_1 ... (2s) Current status: DONE

skipping id
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.la gs://cs327e-open-access-2/school-enrollments/zf406jp4427_la.csv

Waiting on bqjob_r37d3182638649df6_00000186cd15b405_1 ... (4s) Current status: DONE

skipping ma
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.md gs://cs327e-open-access-2/school-enrollments/zf406jp4427_md.csv

Waiting on bqjob_r7e17cf8b181e0cee_00000186cd15cf76_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.mn gs://cs327e-open-access-2/school-enrollments/zf406jp4427_mn.csv

Waiting on bqjob_r4174a1544f1986f0_00000186cd15e2ee_1 ... (4s) Current status: DONE

skipping mo
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ms gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ms.csv

Waiting on bqjob_r206962506b352ed5_00000186cd15fed5_1 ... (2s) Current status: DONE

skipping ne
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nh gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nh.csv

Waiting on bqjob_r6d7f8d70b02dc234_00000186cd161246_1 ... (2s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.nv gs://cs327e-open-access-2/school-enrollments/zf406jp4427_nv.csv

Waiting on bqjob_r749674eef620e219_00000186cd162574_1 ... (2s) Current status: DONE

skipping ny
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.ok gs://cs327e-open-access-2/school-enrollments/zf406jp4427_ok.csv

Waiting on bqjob_r5ff6007ffa34947f_00000186cd16381b_1 ... (3s) Current status: DONE

skipping or
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.pa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_pa.csv

Waiting on bqjob_r1225af832ca2768e_00000186cd164f2e_1 ... (3s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.sc gs://cs327e-open-access-2/school-enrollments/zf406jp4427_sc.csv

Waiting on bqjob_rbe036661cf46f12_00000186cd166af0_1 ... (3s) Current status: DONE

skipping school
skipping sd
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.tx gs://cs327e-open-access-2/school-enrollments/zf406jp4427_tx.csv

Waiting on bqjob_r1d6df3fca5419b88_00000186cd168281_1 ... (4s) Current status: DONE

bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wa gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wa.csv

Waiting on bqjob_r20f9d83a35129b4b_00000186cd169e26_1 ... (5s) Current status: DONE

skipping wi
bq --location=US load --autodetect --skip_leading_rows=1 --source_format=CSV school_enrollments.wy gs://cs327e-open-access-2/school-enrollments/zf406jp4427_wy.csv

Waiting on bqjob_r11c9d1acd97055c2_00000186cd16bde4_1 ... (2s) Current status: DONE

#### 3. Find school enrollments by school name, grade level, and year for Texas

In [5]:
!bq show --schema=true $dataset_id.tx

[{"name":"state","type":"STRING","mode":"NULLABLE"},{"name":"county","type":"STRING","mode":"NULLABLE"},{"name":"county_state_id","type":"STRING","mode":"NULLABLE"},{"name":"admin_level","type":"STRING","mode":"NULLABLE"},{"name":"district_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_id","type":"INTEGER","mode":"NULLABLE"},{"name":"district_state_type","type":"STRING","mode":"NULLABLE"},{"name":"district","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_district_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"school_nces_id","type":"INTEGER","mode":"NULLABLE"},{"name":"school_state_id","type":"FLOAT","mode":"NULLABLE"},{"name":"school","type":"STRING","mode":"NULLABLE"},{"name":"school_state_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_type","type":"STRING","mode":"NULLABLE"},{"name":"ccd_charter_school","type":"BOOLEAN","mode":"NULLABLE"},{"name":"ccd_school_lvl","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_low_grade","type":"STRING","mode":"NULLABLE"},{"name":"ccd_school_high_grade","type":"STRING","mode":"NULLABLE"},{"name":"year","type":"INTEGER","mode":"NULLABLE"},{"name":"term","type":"STRING","mode":"NULLABLE"},{"name":"grade","type":"STRING","mode":"NULLABLE"},{"name":"white","type":"STRING","mode":"NULLABLE"},{"name":"black","type":"STRING","mode":"NULLABLE"},{"name":"hispanic","type":"STRING","mode":"NULLABLE"},{"name":"native_american","type":"STRING","mode":"NULLABLE"},{"name":"native_american_alaskan_native","type":"STRING","mode":"NULLABLE"},{"name":"asian","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian","type":"STRING","mode":"NULLABLE"},{"name":"asian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"native_hawaiian_pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"pacific_islander","type":"STRING","mode":"NULLABLE"},{"name":"multiracial","type":"STRING","mode":"NULLABLE"},{"name":"unknown_race","type":"STRING","mode":"NULLABLE"},{"name":"male","type":"STRING","mode":"NULLABLE"},{"name":"female","type":"STRING","mode":"NULLABLE"},{"name":"non_binary","type":"STRING","mode":"NULLABLE"},{"name":"unknown_gender","type":"STRING","mode":"NULLABLE"},{"name":"ell","type":"STRING","mode":"NULLABLE"},{"name":"ell_percent","type":"STRING","mode":"NULLABLE"},{"name":"homeless","type":"STRING","mode":"NULLABLE"},{"name":"homeless_percent","type":"STRING","mode":"NULLABLE"},{"name":"low_income","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced","type":"STRING","mode":"NULLABLE"},{"name":"free_and_reduced_percent","type":"STRING","mode":"NULLABLE"},{"name":"disability","type":"STRING","mode":"NULLABLE"},{"name":"section_504","type":"STRING","mode":"NULLABLE"},{"name":"total","type":"STRING","mode":"NULLABLE"}]

#### Note: STRING type for "total" column

In [6]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   2160
1     AKINS H S          grade_10  2021   2241
2     AKINS H S          grade_11  2020   1992
3     AKINS H S          grade_11  2021   1989
4     AKINS H S          grade_12  2020   1827
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    207
1735  ZILKER EL      kindergarten  2020    231
1736  ZILKER EL      kindergarten  2021    189
1737  ZILKER EL  pre_kindergarten  2020     90
1738  ZILKER EL  pre_kindergarten  2021     39

[1739 rows x 4 columns]

##### Documentation on BQ's string functions: https://cloud.google.com/bigquery/docs/reference/standard-sql/string_functions

In [7]:
!bq --location=US mk --dataset "views"

BigQuery error in mk operation: Dataset 'river-runner-377401:views' already
exists.

In [8]:
%%bigquery
create view views.austin_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%AUSTIN%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: a0d2bd4e-ae29-4c68-a33d-d836d6dac1e7
Query executing: 0.38s

ERROR:
 409 Already Exists: Table river-runner-377401:views.austin_enrollments_by_school_grade_year

Location: US
Job ID: a0d2bd4e-ae29-4c68-a33d-d836d6dac1e7

In [9]:
%%bigquery
select * from views.austin_enrollments_by_school_grade_year

Query is running:   0%|          |

Downloading:   0%|          |

         school             grade  year  total
0     AKINS H S          grade_10  2020   2160
1     AKINS H S          grade_10  2021   2241
2     AKINS H S          grade_11  2020   1992
3     AKINS H S          grade_11  2021   1989
4     AKINS H S          grade_12  2020   1827
...         ...               ...   ...    ...
1734  ZILKER EL           grade_5  2021    207
1735  ZILKER EL      kindergarten  2020    231
1736  ZILKER EL      kindergarten  2021    189
1737  ZILKER EL  pre_kindergarten  2020     90
1738  ZILKER EL  pre_kindergarten  2021     39

[1739 rows x 4 columns]

#### 4. Open Data Studio and create a chart from this view:
##### https://datastudio.google.com/

#### Project 3 homework marker. Start homework from here.

In [43]:
#%%bigquery
#SELECT column_name from school_enrollments.INFORMATION_SCHEMA.COLUMNS where table_name = 'tx'

This query shows the number of entries that each district has recorded in the tx table with each district having more than 2000 entries.

In [10]:
%%bigquery
select district, count(*) as c 
from school_enrollments.tx
group by district
having count(*) > 2000
order by c desc

Query is running:   0%|          |

Downloading:   0%|          |

                              district      c
0                          HOUSTON ISD  12003
1                           DALLAS ISD  10041
2                       FORT WORTH ISD   6114
3                        NORTHSIDE ISD   5652
4                           AUSTIN ISD   5517
5                      SAN ANTONIO ISD   4473
6                CYPRESS-FAIRBANKS ISD   3870
7                        ARLINGTON ISD   3705
8                  IDEA PUBLIC SCHOOLS   3684
9                          EL PASO ISD   3585
10                       FORT BEND ISD   3399
11                      NORTH EAST ISD   3174
12                            KATY ISD   3072
13                         GARLAND ISD   3018
14                          FRISCO ISD   2706
15                      LEWISVILLE ISD   2655
16                      RICHARDSON ISD   2640
17                           PLANO ISD   2628
18                  CORPUS CHRISTI ISD   2565
19                          YSLETA ISD   2502
20                          ALDINE ISD   2460
21                        PASADENA ISD   2451
22                      ROUND ROCK ISD   2364
23                     BROWNSVILLE ISD   2340
24                        AMARILLO ISD   2337
25                         LUBBOCK ISD   2331
26                         KILLEEN ISD   2316
27                          CONROE ISD   2301
28                         SOCORRO ISD   2229
29                        MESQUITE ISD   2166
30                          UNITED ISD   2151
31  TEXAS COLLEGE PREPARATORY ACADEMIE   2148
32                           KLEIN ISD   2142
33                          HUMBLE ISD   2034
34                     CLEAR CREEK ISD   2025
35                       EDINBURG CISD   2022

In [18]:
%%bigquery
create view views.district_with_2000_entries as
select district, count(*) as c 
from school_enrollments.tx
group by district
having count(*) > 2000
order by c desc

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []

This query shows the number of entries recorded by each county in the tx table with more than 2000 entries.

In [1]:
%%bigquery
select county, count(*) as c
from school_enrollments.tx 
group by county
having count(*) > 2000
order by c desc

Query is running:   0%|          |

Downloading:   0%|          |

                county      c
0        HARRIS COUNTY  45888
1        DALLAS COUNTY  35064
2         BEXAR COUNTY  26277
3       TARRANT COUNTY  23211
4       HIDALGO COUNTY  17532
5        TRAVIS COUNTY  15087
6        COLLIN COUNTY  11877
7       EL PASO COUNTY  11424
8        DENTON COUNTY   8757
9    WILLIAMSON COUNTY   7593
10      CAMERON COUNTY   6849
11     MCLENNAN COUNTY   6189
12         BELL COUNTY   6045
13    FORT BEND COUNTY   5670
14   MONTGOMERY COUNTY   5424
15       NUECES COUNTY   5415
16    GALVESTON COUNTY   5199
17      LUBBOCK COUNTY   4764
18     BRAZORIA COUNTY   4398
19       TAYLOR COUNTY   4218
20         WEBB COUNTY   3843
21        SMITH COUNTY   3498
22    JEFFERSON COUNTY   3486
23        ELLIS COUNTY   3408
24      JOHNSON COUNTY   3336
25      GRAYSON COUNTY   3255
26       POTTER COUNTY   2949
27        BOWIE COUNTY   2730
28         HAYS COUNTY   2607
29    TOM GREEN COUNTY   2598
30        ERATH COUNTY   2535
31        COMAL COUNTY   2514
32      KAUFMAN COUNTY   2409
33         HUNT COUNTY   2358
34       BRAZOS COUNTY   2289
35         HILL COUNTY   2277
36      MIDLAND COUNTY   2253
37       PARKER COUNTY   2235
38      WICHITA COUNTY   2079
39  NACOGDOCHES COUNTY   2064
40        ECTOR COUNTY   2028

In [19]:
%%bigquery
create view views.counties_with_2000_entries as
select county, count(*) as c
from school_enrollments.tx 
group by county
having count(*) > 2000
order by c desc

Query is running:   0%|          |

Empty DataFrame
Columns: []
Index: []

This query selects the schools and the school_state_ids and counts the entries they have that are more than 50. Here, the rows without a school_sate_id have been ommitted.

In [12]:
%%bigquery
select school,school_state_id, count(*) as c
from school_enrollments.tx
where school_state_id is not null
group by school, school_state_id
having count(*) > 50
order by c desc

Query is running:   0%|          |

Downloading:   0%|          |

                school  school_state_id   c
0       AMHERST SCHOOL      140901001.0  96
1       AQUILLA SCHOOL      109912001.0  96
2     BALMORHEA SCHOOL      195902001.0  96
3     BLACKWELL SCHOOL      177903001.0  96
4        BLUFF DALE EL       72904101.0  96
...                ...              ...  ..
2559         WINONA EL      212910101.0  51
2560          WODEN EL      174906101.0  51
2561      DEL VALLE EL       71905145.0  51
2562      THOMAS MANOR       71905146.0  51
2563        ZAVALLA EL        3906101.0  51

[2564 rows x 3 columns]

In [13]:
%%bigquery
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%HOUSTON%'
group by school, grade, year
order by school, grade, year

Query is running:   0%|          |

Downloading:   0%|          |

                                  school            grade  year  total
0                              ALCOTT EL  early_education  2020     30
1                              ALCOTT EL          grade_1  2020     96
2                              ALCOTT EL          grade_1  2021    102
3                              ALCOTT EL          grade_2  2020    102
4                              ALCOTT EL          grade_2  2021     81
...                                  ...              ...   ...    ...
3543  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_7  2021    357
3544  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_8  2020    276
3545  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_8  2021    303
3546  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_9  2020    180
3547  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_9  2021    192

[3548 rows x 4 columns]

In [14]:
%%bigquery
create view views.houston_enrollments_by_school_grade_year as
select school, grade, year, sum(cast(replace(replace(total, ",", ""), "<", "") as int64)) as total
from school_enrollments.tx
where total != "" and school != "" and district like '%HOUSTON%'
group by school, grade, year
order by school, grade, year

Executing query with job ID: d42ab91a-1588-4b59-b61a-5be9af1f03ea
Query executing: 0.33s

ERROR:
 409 Already Exists: Table river-runner-377401:views.houston_enrollments_by_school_grade_year

Location: US
Job ID: d42ab91a-1588-4b59-b61a-5be9af1f03ea

In [15]:
%%bigquery
select * from views.houston_enrollments_by_school_grade_year

Query is running:   0%|          |

Downloading:   0%|          |

                                  school            grade  year  total
0                              ALCOTT EL  early_education  2020     30
1                              ALCOTT EL          grade_1  2020     96
2                              ALCOTT EL          grade_1  2021    102
3                              ALCOTT EL          grade_2  2020    102
4                              ALCOTT EL          grade_2  2021     81
...                                  ...              ...   ...    ...
3543  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_7  2021    357
3544  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_8  2020    276
3545  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_8  2021    303
3546  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_9  2020    180
3547  YOUNG WOMEN'S COLLEGE PREP ACADEMY          grade_9  2021    192

[3548 rows x 4 columns]

This query combines the results of two select statements. The first select statement results in the school names from the houston enrollments and the count entries for each school (entries for each grade and each year). The second select statement results in the school names from the austin enrollments and counts the entries for each school (entries for grade and only the entries for the year 2021). Using union all, (in case two schools from both table have the same name) we get all rows from both select statemnts with the added constraint for the austin enrollment counts being more than 10.

In [48]:
%%bigquery
select school, count(*) as c
from views.houston_enrollments_by_school_grade_year
group by school
union all
select school, count(*) as cc
from views.austin_enrollments_by_school_grade_year
where year = 2021
group by school
having cc > 10
order by c desc

Query is running:   0%|          |

Downloading:   0%|          |

                                 school   c
0                              SOAR CTR  30
1    HOUSTON GATEWAY ACADEMY - CORAL CA  28
2                     T H ROGERS SCHOOL  28
3                COMMUNITY SERVICES-SEC  22
4                GARDEN OAKS MONTESSORI  22
..                                  ...  ..
285             HCC LIFE SKILLS PROGRAM   2
286                   HOUSTON CLASSICAL   2
287       FARIAS EARLY CHILDHOOD CENTER   2
288                      YOUNG LEARNERS   2
289                             EL DAEP   1

[290 rows x 2 columns]

This query combines the results of two select statements. The first statement results in the school name(out of the houston schools) and the sum of the total enrollment only for the first grade . The second statement results in the school name(out of the austin school) and the sum of the total enrollment only for the early education. There is an added constraint that we only want the rows for an early education school if the sum of total enrollment is greater than 30. Here, union all is used just in case a school has the same name in both tables, so we get all the results possible.

In [17]:
%%bigquery
select school, sum(total) as s
from views.houston_enrollments_by_school_grade_year
where grade = "grade_1"
group by school
union all
select school, sum(total) as ss
from views.austin_enrollments_by_school_grade_year
where grade = "early_education"
group by school
having ss > 30
order by s desc

Query is running:   0%|          |

Downloading:   0%|          |

                                 school     s
0    ENERGIZED FOR EXCELLENCE ACADEMY E  1545
1                              NEFF ECC  1302
2                    WEST UNIVERSITY EL  1242
3                        PINEY POINT EL  1155
4                         OAK FOREST EL   960
..                                  ...   ...
221                           WOOTEN EL    60
222                           ZAVALA EL    60
223              COMMUNITY SERVICES-SEC    60
224                   HOUSTON CLASSICAL    48
225                 TSU CHARTER LAB SCH    39

[226 rows x 2 columns]

This query shows the number(approximate number for some entries with the < symbol) of students identified as white in each school where the the value is not left blank and where the school name is not blank.

In [20]:
%%bigquery
select school, sum(safe_cast(replace(replace(white, ",", ""), "<", "") as int64)) as white
from school_enrollments.tx
where white != "" and school != ""
group by school
order by white desc

Query is running:   0%|          |

Downloading:   0%|          |

                                  school  white
0     TEXAS CONNECTIONS ACADEMY AT HOUST  21795
1     TEXAS VIRTUAL ACADEMY AT HALLSVILL  19434
2                            CENTRAL H S  15738
3                      THE WOODLANDS H S  15537
4                              ALLEN H S  15117
...                                  ...    ...
7983          MI ESCUELITA-COCKRELL HILL     30
7984   CHILDCAREGROUP-MARTIN LUTHER KING     30
7985            HEAVENLY LEARNING CENTER     30
7986                       BRYAN'S HOUSE     30
7987               THE PANDA PATH SCHOOL     30

[7988 rows x 2 columns]

This query shows the number of entries that each school has, excluding the schools classified as a "district".

In [44]:
%%bigquery
select school, count(admin_level) as num_of_entries
from school_enrollments.tx
where admin_level != "district"
group by school
order by num_of_entries desc

Query is running:   0%|          |

Downloading:   0%|          |

                                  school  num_of_entries
0                               SMITH EL             702
1                               LAMAR EL             678
2                              TRAVIS EL             663
3                            CROCKETT EL             618
4                              AUSTIN EL             609
...                                  ...             ...
8177          MI ESCUELITA-COCKRELL HILL               6
8178              MI ESCUELITA-CROSSOVER               6
8179          MI ESCUELITA-GOOD SHEPHERD               6
8180  LITTLE EAGLES EARLY LEARNING CENTE               6
8181           VERIBEST SPECIAL PROGRAMS               6

[8182 rows x 2 columns]

This query shows the number of enrollments the schools in Austin have, with the added constraint that this number be less than 4000.

In [3]:
%%bigquery
select school, sum(total) as tt
from views.austin_enrollments_by_school_grade_year
group by school
having tt < 4000
order by tt

Query is running:   0%|          |

Downloading:   0%|          |

                            school    tt
0          TRAVIS COUNTY J J A E P    30
1                         DAEP- EL    30
2               MAINSPRING SCHOOLS   126
3         TRAVIS COUNTY DAY SCHOOL   180
4   GRADUATION PREPARATORY ACADEMY   186
..                             ...   ...
94                    BRENTWOOD EL  3756
95                        WEBB M S  3819
96                 WALNUT CREEK EL  3927
97                    DOBIE MIDDLE  3942
98                        CASIS EL  3996

[99 rows x 2 columns]